cask_args appdir: "/Applications"

tap "buo/cask-upgrade"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "dteoh/sqa"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"
tap "universal-ctags/universal-ctags"

brew "mas"
brew "rcm"
cask "java"

brew "asdf"
brew "automake"
brew "awscli", link: false
brew "bat"
brew "broot"
brew "cmake"
brew "coreutils"
brew "diff-so-fancy"
brew "eth-p/software/bat-extras"
brew "fish"
brew "fzf"
brew "gpg"
brew "heroku/brew/heroku"
brew "jq"
brew "less"
brew "llvm"
brew "lua@5.1"
brew "neovim"
brew "postgresql", restart_service: true
brew "pstree"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "ripgrep"
brew "tmux"
brew "tree"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "xmlstarlet"
brew "yarn"

cask "atom"
cask "chromedriver"
cask "google-chrome"
cask "launchbar"
cask "kitty"
cask "xscreensaver"

cask "firefox-developer-edition"
cask "iterm2-beta"

cask "dteoh/sqa/slowquitapps"

mas "Amphetamine", id: 937984704
mas "Dashlane", id: 552383089
mas "OmniGraffle", id: 711830901
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
