cask_args appdir: "/Applications"

tap "buo/cask-upgrade"
tap "homebrew/cask-cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "dteoh/sqa"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"
tap "universal-ctags/universal-ctags"

brew "mas"
brew "rcm"
cask "java"

brew "asdf"
brew "automake"
brew "cmake"
brew "coreutils"
brew "diff-so-fancy"
brew "fish"
brew "fzf"
brew "gpg"
brew "heroku/brew/heroku"
brew "jq"
brew "llvm"
brew "lua@5.1"
brew "neovim"
brew "postgresql", args: ["with-dtrace"], restart_service: true
brew "pstree"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "ripgrep"
brew "tmux"
brew "tree"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "xmlstarlet"
brew "yarn", args: ["without-node"]

cask "alfred"
cask "atom"
cask "bat"
cask "caffeine"
cask "chromedriver"
cask "google-chrome"
cask "kitty"
cask "xscreensaver"

cask "caskroom/versions/firefox-developer-edition"
cask "caskroom/versions/iterm2-beta"

cask "dteoh/sqa/slowquitapps"

mas "Dashlane", id: 552383089
mas "OmniGraffle", id: 711830901
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
