cask_args appdir: "/Applications"

tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "thoughtbot/formulae"
tap "universal-ctags/universal-ctags"

brew "mas"
brew "rcm"
cask "java"

brew "automake"
brew "cmake"
brew "coreutils"
brew "rbenv"
brew "fish"
brew "fzf"
brew "jq"
brew "postgresql", args: ["with-dtrace"], restart_service: true
brew "llvm"
brew "lua@5.1"
brew "neovim"
brew "pstree"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "xmlstarlet"
brew "yarn", args: ["without-node"]

cask "alfred"
cask "atom"
cask "firefox-developer-edition"
cask "google-chrome"
cask "iterm2-beta"
cask "xscreensaver"

mas "Dashlane", id: 552383089
mas "OmniGraffle", id: 711830901
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
